/*************************************************************************
	> File Name: 0508对角元素和.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月28日 星期五 12时53分38秒
 ************************************************************************/
//3*3矩阵，
//求两条对角线元素的和(每个元素只加一次)
//思路：sum += a[i][i] + a02 a11 a20
#include<stdio.h>
int main()
{
    int a[][3] = {{1,2,3},
                  {4,5,6},
                  {7,8,9}};

    int i = 0;
    int j = 0;
    int sum1 = 0;
    int sum2 = 0;

    for(i = 0; i < 3; i++)
    {
        sum1 += a[i][i];              //计算主对角线
        for(j = 3-1-i; j >= 0; j--)   //倒着for循环 副对角线看作主对角线
        {
            if(i == j)/*如果i=j 直接跳出*/
            {
                break;
            }
            else                             //去除中间重复元素
            {
                sum2  += a[i][j];         //计算副对角线
  //              printf("%d ",a[i][j]);
                break;    
            }
        }
    }
    printf("%d,%d,%d", sum1, sum2, sum1+sum2);


    return 0;
}
