/*************************************************************************
	> File Name: 0509杨辉三角.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月28日 星期五 16时10分56秒
 ************************************************************************/
//打印杨辉三角
//二维数组实现
#define n 10
#include<stdio.h>
int main()
{
    int i = 0;
    int j = 0;
    int a[100][100] = {0};

    for(i = 0; i < n; i++)
    {
        a[i][0] = 1;
        //a[i][i] = 1;
        for(j = 1; j <= i; j++)
        {
            a[i][j] = a[i-1][j] + a[i-1][j-1];
        }
    }
    //打印
    for(i = 0; i < n; i++)
    {
        for(j = 0; j < n-i; j++)          //正确格式 多少空格
        {
            printf("   ");
        }
        for(j = 0; j <= i; j++)
        {
            printf(" %4d ",a[i][j]);
        }
        putchar(10);
    }


    return 0;
}
