/*************************************************************************
	> File Name: 行最大值.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月28日 星期五 16时38分05秒
 ************************************************************************/
//求二位数组行最大值
//以及他们的和

#include<stdio.h>
int main()
{
    int sum = 0;
    int i = 0;
    int j = 0;
    int max = 0;
    int a[5][5] = {{1,2,6,4,5},
                   {5,4,4,2,1},
                   {3,2,9,5,4},
                   {2,1,5,3,4},
                   {4,2,1,7,5}};

    for(i = 0; i < 5; i++)
    {
        max = 0;
        for(j = 0; j < 5; j++)
        {
            if(a[i][j] > a[i][max])
            {
                max = j;
            }
        }
        printf("行最大值为：%d\n", a[i][max]);
        sum += a[i][max];
    }
    printf("最大值：%d", sum);


    return 0;
}
