/*************************************************************************
	> File Name: 0517矩阵.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月28日 星期五 20时33分43秒
 ************************************************************************/
//打印矩阵
//对角线是1 上三角是2 左3 右4 下5
//例如    要求：不允许键盘输入语句和静态赋值语句，尽量少用循环
//1 2 2 2 1
//3 1 2 1 4
//3 3 1 4 4
//3 1 5 1 4
//1 5 5 5 1
#define n 9 //奇数
#include<stdio.h>
int main()
{
    int a[n][n] = {0};

    int i = 0;
    int j = 0;
    
    for(i = 0; i < n; i++)
    {
        for(j = 0; j < n; j++)
        {
            if(j <= n/2)            //左半边打印3
            {
                a[i][j] = 3; 
            }
            if(j >= n-n/2)             //右半边打印4             之后3和4其余部分的值会被其他数字填充
            {
                a[i][j] = 4;
            }
        }
        if(i <= n/2)            //打印上三角
        {
            for(j = i; j < n-i; j++)
            {
                a[i][j] = 2;
            }
        }
        if(i >= n-n/2)            //打印下三角
        {
            for(j = n -i; j < i; j++)
            {
                a[i][j] = 5;
            }
        }

        //最后覆盖对角线1
        a[i][i] = 1;      //if(i == j)
        a[i][n-i-1] = 1;  //if(i+j == n-1)
    }

    for(i = 0; i < n; i++)
    {
        for(j = 0; j < n; j++)
        {
            printf("%2d", a[i][j]);
        }
        putchar(10);
    }

    return 0;
}
