/*****************************
 * ********************************************
	> File Name: 0523魔方阵.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月30日 星期日 20时12分05秒
 ************************************************************************/
/*功能：打印魔方阵。所谓魔方阵是指这样的方阵，它的每一行、每一列和对角线之和均相等。例如：三阶魔方阵为 
                        8  1  6  
                        3  5  7 
                        4  9  2  
    要求打印由 1到 N^2的自然数构成的魔方阵。 
    提示：魔方阵中各数的排列规律如下： 
      ⑴  将“1”放在第一行中间一列； 
      ⑵  从“2”开始直到n×n为止各数依次按下列规则存放：每一个数存放的行比前一个数的行数减1，列数加1；(向上相右) 
      ⑶  如果上一个数的行数为1，则下一个数的行数为 n（指最下一行）； 
      ⑷  上一个数的列数为 n，下一个数的列数应为1，行数减1； 
      ⑸  如果按上面规则确定的位置已有数，或上一个数是第 1行第 n列时， 则把下一个数放在上一个数的下面。 
*/

#define N 5  //N可以为任意奇数 因为偶数没有中间的一列
#include<stdio.h>
//改进方法
int main()
{
    int i = 0;
    int j = N/2;
    int num = 1;
    int a[N][N] = {0};
    int ci = 0;
    int cj = 0;

    while(num < 26)
    {
        a[i][j] = num++;          //将当前num存入a[i][j]
        ci = i;           
        cj = j;                   //上一个i，j的值

        if(ci == 0)               //如果上一个数在第0行
        {
            i = N-1;
        }
        else
        {
            i--;
        }
        if(cj == N-1)            //如果上一个数在第N-1列
        {
            j = 0;
        }
        else
        {
            j++;
        }
    
        if(a[i][j] != 0 || (ci == 0 && cj == N-1))//如果上一个值在右上角 或者 下一个位置有数字的话 直接填充正下方
        {
            i = ci+1;           //上一个的正下方
            j = cj;             //因为在上一步的判断i和j已经越界 需要重新赋值 
        }

    }

    for(int i = 0; i < N; i++)
    {
        for(int j = 0; j  < N; j++)
        {
            printf("%2d ", a[i][j]);
        }
        putchar(10);
    }
    return 0;
}








//自己的方法
int main1()
{
    int a[N][N] = {0};
    int i = 0;
    int j = N/2;
    int num = 1;

    while(num < N*N+1)
    {
        if(num == 1)     //如果num是1
        {
            a[i][j] = num++;
        }
        else
        {

            if((i >= 1 && j < N-1)  && (a[i-1][j+1] != 0)) //如果下一个右上位置有数字的话 将其下方放数字
            {
                i = i+1;
                a[i][j] = num++;
            }
            else if(i == 0 && j == N-1)               // 如果上一个数字在右上角 将其下方置放数字
            {
                i = i+1;
                a[i][j] = num++;
            }
            else if ((i == 0 && j < N-1) && a[N-1][j+1] != 0) //如果在第一行 且第三行的右列有数字的话 将其下方放数字
            {
                i = i+1;
                a[i][j] = num++;
            }
            else if ((j == N-1 && i >= 1) && a[i-1][0] != 0) //如果在第N列 且第一列的上方有数字的化 将其下方放数字
            {
                i = i+1;
                a[i][j] = num++;
            }
            else                                            // 其他
            {
                if(i == 0)         // 第一行              第三行的右列放数字
                {
                    i = N - 1;
                    j = j + 1;
                    a[i][j] = num++;
                }
                else
                {
                    if(j == N-1) //第N列                  第一列的上方放数字
                    {
                        i = i - 1;
                        j = 0;
                        a[i][j] = num++;
                    }
                    else                                //直接在右上方放数字
                    {
                        i = i - 1;
                        j = j + 1;
                        a[i][j] = num++;
                    }
                }
            }
        }
    }


    for(int i = 0; i < N; i++)
    {
        for(int j = 0; j < N; j++)
        {
            printf("%3d ", a[i][j]);
        }
        putchar(10);
    }
    return 0;
}
