/*************************************************************************
	> File Name: 0524统计年龄.c
	> Author: 
	> Mail: 
	> Created Time: 2017年05月02日 星期二 16时23分31秒
 ************************************************************************/
//把相同年龄最多的那个年龄找出来
//并统计出现的次数
//
/*用另一个数组下标存年龄 每出现一次值加1 则年龄出现的次数为数组的值*/
#include<stdio.h>
void total(int a[], int b[], int l)
{
    for(int i = 0; i < l; i++)
    {
        b[a[i]]++;
    }
}
int main()
{
    int a[] = {23,24,25,21,24,24,24,25,26,27,25,24,23,23,23,23,24,24,24,24};
    int len = sizeof(a)/sizeof(int);
    int b[100] = {0};
    int max = 0;

    total(a, b, len);
    

    for(int i = 0; i < 100; i++)
    {
        if(b[i] > b[max])
        {
            max = i;
        }
    }
    printf("相同最多的年龄：%d \n出现次数：%d", max, b[max]);


    return 0;
}
