/*************************************************************************
	> File Name: p21_4_for.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月09日 星期日 11时39分58秒
 ************************************************************************/
//for循环
//求 2^0+……+2^63
#include<stdio.h>
int main()
{
    int i = 0;
    double sum = 1;
    double a = 1;
    for(i = 1; i <= 63; i++)
    {
        a *= 2;
        //printf("%.2e,", a);
        sum += a;        
    }
    printf("%.2e", sum);
    return 0;
}

