/*************************************************************************
	> File Name: p21_19_改进.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月26日 星期三 12时54分53秒
 ************************************************************************/
//给定误差 0.1 0.01 等 求第n+1项的值
#include<stdio.h>
void go(float num)
{
    float n = 1;
    float J1 = ((2*n)/(2*n+1)) * ((2*n+2)/(2*n+1));
    float J2 = ((2*n)/(2*n+1)) * ((2*n+2)/(2*n+1));
    do
    {
        n += 1;
        J1 = J2;    //记录前一项 
        J2 *= ((2*n)/(2*n+1)) * ((2*n+2)/(2*n+1));
    }while(J1-J2 > num);//若num=0.1 ，当精度大于0.1时继续循环 
    //小于0.1时跳出循环
    printf("结果是%f \n", J1); 
}

int main()
{

    go(0.1);
    go(0.01);
    go(0.001);
    go(0.0001);
    go(0.00001);






    return 0;
}
