/*************************************************************************
	> File Name: p21_15_for.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月22日 星期六 21时07分26秒
 ************************************************************************/
//13  62
//13*62 == 31*26
//求共有多少对这样性质的两位数
//个位十位相同的不在此列
//重复出现的不在此列
//例如 31*26 = 13*62
#include<stdio.h>
int main()
{
    int i = 0, j = 0;
    int count = 0;

    for(i = 10; i <= 99; i++)
    {
        //for(j = 10; j <= 100; j++) no
        for(j = i; j <= 100; j++)    //yes j = i 与之后的数进行比较
        {
            if((i%10 != i/10) && (j%10 != j/10))
            {
                if(i*j == (i%10*10+i/10) * (j%10*10+j/10))
                {
                    count++;
                    printf("%d*%d\n",i, j);
                }
            }
        }
        
    }
    printf("共有%d对", count);

    return 0;
}
