/*************************************************************************
	> File Name: p21_10.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月18日 星期二 22时57分15秒
 ************************************************************************/
//求1-100所有非素数的和
//
#include<stdio.h>
#include<math.h>

/*另一种思路： 
 * 在判断一个数是否是素数的基础上 增加一个循环每次传入i if(不是素数) 求和*/
int main()
{

    int i = 0, j = 0;
    int sum = 0; //非素数的和

    for(i = 2; i <= 100; i++)
    {
        for(j = 2; j <= sqrt(i); j++)
        {
            if(i % j == 0)
            {
                sum += i;
                break;
            }
        }
    }
    printf("%d", sum);

    return 0;
}
