/*************************************************************************
	> File Name: p21_16_for.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月25日 星期二 12时17分52秒
 ************************************************************************/
//一个数恰好等于它的因子之和
//这个数被称为完数
//例如 6 = 1+2+3;
//
//找出1000以内所有完数
#include<stdio.h>
int main()
{
    int i = 0;
    int j = 0;
    int sum = 0;
    for(i = 1; i <= 1000; i++)
    {
        for(j = 1; j <= i/2; j++)
        {
            if(i%j == 0)
            {
                sum += j;      //找到数i的所有因数的和
            }
        }                      /*思路：将因数存入数组中输出*/
        if(i == sum)           //如果因数和等于自身
        {
            printf("%3d its factors are:", i);

            for(int k = 1; k <= sum/2; k++)//求出自身的所有因数并打印
            {
                if(i%k == 0)
                {
                    printf(" %d", k);
                }
            }
            putchar(10);
        }
        sum = 0;
    }

//可读性差
    return 0;
}
