/*************************************************************************
	> File Name: 1.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月26日 星期三 23时24分48秒
 ************************************************************************/
//二维数组转化为一维数组
#include<stdio.h>
#include<math.h>
void trans(int a[][5], int b[])
{
    for(int i = 0; i < 3; i++)
    {
        for(int j = 0; j < 5; j++)
        {
            b[i*5+j] = a[i][j];
        }
    }
    for(int i = 0; i < 15; i++)
    {
        printf("%d ", b[i]);
    }
}
int main()
{
    int a[3][5] = {{1,2,3,4,5},{6,7,8,9,10},{11,12,13,14,15}};
    int b[15] = {0};

    trans(a, b);
    
    return 0;
}
