/*************************************************************************
	> File Name: 输入长度的数组.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月25日 星期二 17时13分17秒
 ************************************************************************/
//数组长度由自己输入  
//但是不能在声明的时候初始化
#include<stdio.h>
int main()
{
    int a = 0;
    scanf("%d", &a);
    int arr[a];

    for(int i = 0; i < a; i++)
    {
        scanf("%d ", &arr[i]);
    }
    for(int i = 0; i < a; i++)
    {
        printf("%d ", arr[i]);
    }
    

    return 0;
}
