/*************************************************************************
	> File Name: 同构数.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月22日 星期六 20时49分50秒
 ************************************************************************/
//一个数恰好等于塔的平方数的右端 例如5的平方25 
//5 是 25 右端的数 
//5 就是同构数
#include<stdio.h>
int main()
{
    int i = 0;

    for(i = 1; i <= 1000; i++)
    {
        if(i == i*i%10 || i == (i*i)%100 || i == (i*i) % 1000)
        {
            printf("%d ", i);
        }
    }

    return 0;
}
//通用性不够
//统计位数 几位数字n乘几次10 然后模 n
