/*************************************************************************
	> File Name: 001非负整数解.c
	> Author: 
	> Mail: 
	> Created Time: 2017年08月20日 星期日 00时15分47秒
 ************************************************************************/
//编程求 5X + 2Y + Z = 50 的所有非负整数解
#include<stdio.h>
int main()
{
    for(int i = 0; i <= 10; i++)
    {
        for(int j = 0; j <= 25; j++)
        {
            for(int k = 0; k <= 50; k++)
            {
                if(5*i+2*j+k == 50)
                {
                    printf("X = %2d  Y = %2d  Z = %2d\n",i ,j, k);
                }
            }
        }
    }

    return 0;
}
