/*************************************************************************
	> File Name: 005排队人数.c
	> Author: 
	> Mail: 
	> Created Time: 2017年08月20日 星期日 20时38分24秒
 ************************************************************************/
//3路队伍多2人  5路队伍多3人   7路队伍正好  
//求至少多少人
#include<stdio.h>

int main()
{
    int n = 1; // 记录人数
    while(1)
    {
        if((n % 3 == 2) &&  (n % 5 == 3) && !(n % 7))
        {
            break;
        }
        n++;
    }
    printf("%d", n);
    return 0;
}
