/*************************************************************************
	> File Name: 006数组漏斗.c
	> Author: 
	> Mail: 
	> Created Time: 2017年08月20日 星期日 20时45分41秒
 ************************************************************************/
//6*6 数组  16行和对角线是1   其余为-1
#include<stdio.h>


int main()
{
    int arr[6][6];
    
    for(int *p = &arr[0][0]; p < &arr[0][0] + 36; p++)
    {
        *p = -1; 
    }

    for(int i = 0; i < 6; i++)
    {
        for(int j = 0; j < 6; j++)
        {
            if(i == j || i + j == 5 || i == 0|| i == 5 )
            {
                arr[i][j] = 1;
            }
            printf(" %2d ", arr[i][j]);
        }
        putchar(10);
    }

    return 0;
}
