/*************************************************************************
	> File Name: 009雨算术题.c
	> Author: 
	> Mail: 
	> Created Time: 2017年08月20日 星期日 21时06分39秒
 ************************************************************************/
// (? *(?3 + ?))^2 = 8??9    第一个数字不是1
// 求出问号代表的数字
#include<stdio.h>

int main()
{
    int i = 0;
    for(int i = 90; i < 100; i++)
    {
        if(i*i % 10 == 9 && i*i / 1000 == 8)
        {
            printf("%d\n", i);
        }
    }
    for(int i = 1; i <= 9; i++)
    {
        for(int j = 1; j <= 9; j++)
        {
            for(int k = 1; k <= 9; k++)
            {
                if(i*(j*10+3 +k) == 93)
                {
                    printf("%d  %d  %d", i, j, k);
                }
            }
        }
    }
}
