/*************************************************************************
	> File Name: 0115*5对称.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月08日 星期五 23时05分00秒
 ************************************************************************/
//判断是否以第三列为轴线对称
#include<stdio.h>
int main()
{
    int a[5][5] = {
        {1,1,1,1,1},
        {2,2,2,2,2},
        {3,3,3,3,3},
        {2,2,2,2,3},
        {1,1,1,1,1}};

    int flag = 1;
    
    for(int i = 0; i < 5/2; i++)
    {
        for(int j = 0; j < 5; j++)
        {
            if(a[i][j] != a[4-i][j])
            {
                flag = 0;
                break;
            }
        }
    }
    if(flag == 1)
    {
        printf("对称\n");
    }
    else
    {
        printf("不对乘\n");
    }



    return  0;
}
