/*************************************************************************
	> File Name: 016矩阵.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月09日 星期六 10时28分20秒
 ************************************************************************/
//找规律, 打印6*6矩阵
//
/* 1  2  3  5  8  13        前两个数相加为后一个数
 * 1  4  9  17 30 51        从第二个数开始每个数字 等于左+上+左上的数字相加  
 * 1  6  19 45 92 173        
 */
#include<stdio.h>
int main()
{
    int a[6][6] = {0};

    
    for(int i = 0; i < 6; i++)
    {
        a[i][0] = 1;
    }
    a[0][1] = 2;
    
    for(int i = 2; i < 6; i++)
    {
        a[0][i] = a[0][i-1] + a[0][i-2];
    }

    for(int i = 1; i < 6; i++)
    {
        for(int j = 1; j < 6; j++)
        {
            a[i][j] = a[i-1][j] + a[i][j-1] + a[i-1][j-1];
        }
    }

    for(int i = 0; i < 6; i++)
    {
        for(int j = 0; j < 6; j++)
        {
            printf("%3d ", a[i][j]);
        }
        printf("\n");
    }

    return 0;
}
