/*************************************************************************
	> File Name: 017数4.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月09日 星期六 10时57分42秒
 ************************************************************************/
//有人说400,401,402...499这些数字共出现112次,
//如果正确打印YES 错误NO 并打印4出现的正确次数
#include<stdio.h>

int main()
{
    int num = 0;
    for(int i = 400; i <= 499; i++)
    {
        if(i%10 == 4)
        {
            num++;
            printf("%d\n", i);
        }
        if(i/10%10 == 4)
        {
            num++;
            printf("%d\n", i);
        }
        if(i/100 == 4)
        {
            num++;
            printf("%d\n", i);
        }
    }
    if(num == 112)
    {
        printf("YES\n");
    }
    else
    {
        printf("NO  %d", num);
    }


    return 0;
}
