/*************************************************************************
	> File Name: 019算术.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月12日 星期二 15时26分33秒
 ************************************************************************/
//?6325 = 6325?*?
//问号位置填3个数字, 如果没有 打印NO
//如果有多个 ,打印其中一组
#include<stdio.h>


int main()
{
    int x = 6325;
    
    int flag = 0;
    for(int i = 1; i <= 9; i++)
    {
        for(int j = 0; j <= 9; j++)
        {
            for(int k = 0; k <= 9; k++)
            {
                if(10000*i + x == (x*10 + j) * k)
                {
                    printf("i = %d j = %d k = %d\n", i, j, k);
                    flag = 1;
                    break;
                }
            }
        }
    }
    if(flag == 0)
    {
        printf("NO\n");
    }

    return 0;
}
