/*************************************************************************
	> File Name: 026偶数.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月13日 星期三 17时40分49秒
 ************************************************************************/
//把一个偶数位的数从当中分开乘两个数,这两个数的和的平方等于原数
//如(8+1)^2 = 81  求10-9999之间满足这样条件的数是那些? 共有多少个?
#include<stdio.h>
#include<math.h>

int main()
{

    for(int i = 10; i < 9999; i++)
    {
        if(i%2 != 0)
        {
            if(pow((i/10 + i%10),2) == i)  //两位数
            {
                printf("%d  ", i);
            }
            if(pow((i/100 + i%100),2) == i) //四位数
            {
                printf("%d  ", i);
            }
        }
    }
    

    return 0;
}
