/*************************************************************************
	> File Name: 029二维数组平均值.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月14日 星期四 16时50分56秒
 ************************************************************************/
//求二维数组每行元素的平均值
//不许引入其他的数组
#include<stdio.h>

int main()
{
    int a[3][3] = {{1,2,3},{4,5,6},{7,8,9}};

    int sum = 0;
    float ave = 0.0;

    for(int i = 0; i < 3; i++)
    {
        sum = 0;
        int j = 0;
        for(j = 0; j < 3; j++)
        {
            sum += a[i][j];
            printf("%d ", a[i][j]);
        }
        ave = sum / j;
        printf("第%d行平均值: %.2f", i+1, ave);
        putchar(10);
    }


    return 0;
}
