/*************************************************************************
	> File Name: 030函数.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月14日 星期四 17时00分35秒
 ************************************************************************/
//编码计算函数 P(x) = p(0)x^n + ... + b(n-1)x + b(n)的值
//要求先将X的各项系数先输入到数组B中, 然后再循环结构求P(x)的值
#include<stdio.h>
#include<math.h>
#define N 10
int main()
{
    int B[N] = {1,2,3,4,5,6,7,8,9,10}; 
    int x = 2;
    float P;

    for(int i = 0; i < N; i++)
    {
        P += B[i]*pow(x, N-i);
    }

    printf("%f", P);

    return 0;
}

