/*************************************************************************
	> File Name: 031打印矩阵.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月16日 星期六 23时49分32秒
 ************************************************************************/
//将6*6矩阵  左下打印-1 右上1
//主对角线为2  对齐输出
#include<stdio.h>

int main()
{
    int a[6][6];
    for(int i = 0; i < 6; i++)
    {
        for(int j = 0; j < 6; j++)
        {
            if (i == j)
            {
                a[i][i] = 2;
            }
            else if (j > i)
            {
                a[i][j] = 1;
            }
            else
            {
                a[i][j] = -1;
            }
        }
    }
    for(int i = 0; i < 6; i++)
    {
        for(int j = 0; j < 6; j++)
        {
            printf("%2d", a[i][j]);
        }
        putchar(10);
    }

    return 0;
}
