/*************************************************************************
	> File Name: 039移动.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月17日 星期日 13时11分29秒
 ************************************************************************/
//由n个整数, 将前面的各个数一次向后移动k个位置 最后k个数移动到最前变k个位置
//n = 8 
//k = 3
//1 2 3 4 5 6 7 8
//6 7 8 1 2 3 4 5
//不能引入其他数组
#include<stdio.h>

void move(int a[])
{
    int flag = a[7];
    for(int i = 7; i >= 0; i--)
    {
        a[i] = a[i-1];
    }
    a[0] = flag;
}

int main()
{
    int a[8] = {1,2,3,4,5,6,7,8};
    int k = 1;
    for(int i = 0; i < k; i++)
    {
        move(a);
    }

    for(int i = 0; i < 8; i++)
    {
        printf("%d ", a[i]);
    }
    return 0;
}

