/*************************************************************************
	> File Name: 043n的阶乘.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月19日 星期二 21时53分37秒
 ************************************************************************/
//求n!末尾由多少个零  可以通过检查n!中含有多少10的因数来求塔末尾0的个数
//10=2*5  ,n!中 2的因数显然多余5
//一种求n!中5的因数的个数算法如下:
//1) 输入正整数n
//2) 0 => k  n => m
//3) 若m<5 转第5步  否则执行下一步
//4) m/5(取整) => m  k+m => k  转第三步
//5) 输出 k(0的个数)
#include<stdio.h>

int main()
{
    int n,k,m;
    k = 0;
    n = 13;
    m = n;
    while(1)
    {
        if(m < 5)
        {
            break;
        }
        m /= 5;
        k += m;
    }




    printf("%d\n", k);


    return 0;
}

