/*************************************************************************
	> File Name: 044分离数组.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月19日 星期二 22时10分49秒
 ************************************************************************/
//分别输入N和M个数到数组A和数组B中
//把只在其中一个数组中出现的那些数送入到数组C中 
//并指出他们在A或B数组中的位置
#include<stdio.h>

int main()
{
    int a[10] = {1,2,3,4,5,6,7,8,9,0};
    int b[10] = {11,2,111,4,12,6,7,8,9,13};
    int c[40] = { 0 };          
    int k = 0;
    
    for(int i = 0; i < 10; i++)
    {
        int flag1 = 0;
        int flag2 = 0;
        for(int j = 0; j < 10; j++)
        {
            if(a[i] == b[j])   //如果有相等,,不放入c数组
            {
                flag1 = 1;
            }
            if(b[i] == a[j])
            {
                flag2 = 1;
            }
        }
        if(flag1 != 1)
        {
            a[i] == c[k++];
            printf("A数组第%d 是%d\n",i, a[i]);
        }
        if(flag2 != 1)
        {
            a[i] == c[k++];
            printf("B数组第%d 是%d\n",i, b[i]);
        }
    }


    return 0;
}

