/*************************************************************************
	> File Name: 046矩阵相乘.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月20日 星期三 14时45分37秒
 ************************************************************************/
//M1是3*5矩阵   M2是5*2矩阵  编程求出M1与M2之积
#include<stdio.h>
void Mul(int M1[][5], int m, int M2[][2], int n, int M3[][2])
{
    for(int i = 0; i < 3; i++)
    {
        for(int j = 0; j < 2; j++)
        {
            for(int k = 0; k < 5; k++)
            {
                M3[i][j] += M1[i][k]*M2[k][j];
            }
        }
    }
}


int main()
{
    int M1[3][5] = {{1,2,3,4,5},
                    {1,2,3,4,5},
                    {1,2,3,4,5}
        
    };
    int M2[5][2] = {{1,2,},{3,4},{5,6},{7,8},{9,0}};
    int M3[3][2] = {0};


/*
     1 2 3 4 5     1 2       3 2 2 2 2 2
     1 2 3 4 5     3 4       
     1 2 3 4 5     5 6
                   7 8 
                   9 1
    1*1 + 1*2  + 2*3+ 2*4 + ...
    左边第一行 乘 右边第一列 得到第一行第一列M[0][0]
          一            二   得到第一行第二列M[0][1]
    */

    Mul(M1, 3, M2, 5, M3);

    for(int i = 0; i < 3; i++)
    {
        for(int j = 0; j < 2; j++)
        {
            printf("%d ", M3[i][j]);
        }
        printf("\n");
    }


    return 0;
}

