/*************************************************************************
	> File Name: 047百马百瓦.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月20日 星期三 15时08分40秒
 ************************************************************************/
//百马百瓦问题, 由有100匹马和100块瓦  大马驮3块 小马2块,  两个马驹1块
//问大马 小马 马驹 各应该为多少
//不许用for循环
//循环此数尽量少
#include<stdio.h>

int main()
{
    int i, j;
    i = j = 0;


    while(i < 33)
    {
        j = 0;
        while(j < 50)
        {
            int k = (100-3*i-2*j)*2;
            if(i+k+j == 100)
            {
                printf("大马:%d  小马:%d   马驹:%d \n", i, j, k);
            }
            j++;
        }
        i++;
        //printf("11 ");
    }

    return 0;
}

