/*************************************************************************
	> File Name: 058最大平台.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月23日 星期六 13时33分08秒
 ************************************************************************/
//有n个整数 a1,a2,...  an 若满足 a1 <= a2 <=  ... <= an
//则认为在这n个数中有最大平台,在这种情况下,若n个数互不相同,则最大平台值为1
//若在n个数中最多有连续m个整数的值相等,则最大平台值为m
//例如 n=10
//1,2,3,4,5,6,6,7,4,5    无最大平台
//1,1,2,2,2,2,2,2,2,2    最大平台值为8
//1,1,2,2,2,3,3,4,4,5    最大平台值为3
//0,1,2,3,4,5,6,7,8,9    最大平台值为1
#include<stdio.h>

int main()
{

    //int a[10] = {1,2,3,4,5,6,6,7,4,5};   //    无最大平台
    //int a[10] = {1,1,2,2,2,2,2,2,2,2};     // 最大平台值为8
    int a[10] = {1,1,2,2,2,3,3,4,4,5};     // 最大平台值为3
    //int a[10] = {0,1,2,3,4,5,6,7,8,9};    //最大平台值为1
    

    int index_x = 0;  //前一个元素下标
    int index_y = 1;  //后
    int plen = 0;     //记录平台长度
    int max_plen = 0; //记录最大长度
    while(index_y < 10)
    {
        if(a[index_x] > a[index_y])
        {
            plen = -1;
            break;
        }
        else if(a[index_x] < a[index_y])
        {
            plen = 0;
        }
        else if(a[index_x == a[index_y]])
        {
            
            plen++;
            if(plen > max_plen)
            {
                max_plen = plen;
            }
        }
        index_x++;
        index_y++;
    }

    max_plen += 1;

    if(plen == 0)
    {
        printf("最大平台值为%d\n", max_plen);
    }
    else if(plen > 0)
    {
        printf("最大平台值为%d\n", max_plen);
    }
    else
    {
        printf("无最大平台\n");
    }

    return 0;
}
