/*************************************************************************
	> File Name: 060回文数猜想.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月24日 星期日 13时13分42秒
 ************************************************************************/
/*60.	回文数指左右数字对称的数如 121   2112 都是回文数。回文数猜想取一任意十进制数将其倒过来并将这两个数相加然后把这个相加的和倒过来再与原数相加... 重复此过程可得到一个回文数。如取68为任意数经三步相加可得回文数
 *
 * 测试数据  68  5  876   12501
 *
1	不要随便自选数据因为对有的数经几十万次以上相加还未得到回文数。 
2	由于一位、两位数十分简单故仅从3位数开始才判它是否为回文数。即5,55,66这样的数在此处不把它当作回文数。 
* */
#include<stdio.h>


//逆序
int nixu(int num)
{
    int len = 0;
    int n = num;
    while(n)
    {
        len++;
        n /= 10;
    }
    n = num;

    int x = 0;
    for(int i = 0; i < len; i++)
    {
        x = x*10 + n%10;
        n /= 10;
    }
    return x;
}

int main()
{

    int n = 25451;
    int sum = 0;
    int x = n;

    while(1)
    {   
        sum = x+nixu(x);
        printf("%d + %d\n", x, nixu(x));
        x = sum;
        if(x > 100)   // 判断3位以上
        {
            if(nixu(x) == x)
            {
                printf("%d回文值:%d", n, x);
                break;
            }
        }
    }

    return 0;

}
