/*************************************************************************
	> File Name: 互质数.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月26日 星期二 15时00分39秒
 ************************************************************************/
/*
 * 任意两个互质的自然数, 经过若干次加减后总可获得结果为1的数值。
 * 所谓互质数即互素的数是指这两个数除 1外再没有其它公因数。
 * 如14, 9为互质数又如187,79也是互质数。
 * 例如对于互质数14和9   14+14=28  9+9+9=27 因28-27=1, 目的达到。
 * 请编程序对两个互质数验证上述结论
* */
#include<stdio.h>

int main()
{
    int num1 = 79;   //两个互质数
    int num2 = 187;

    int flag = 1;  //互质为1 否则为0
    for(int i = 2; i < num1; i++)
    {
        if(num2%i == 0 && num1%i == 0 && num2 < i)
        {
            flag = 0;
        }
    }

    int sum1 = num1;   //记录相加和
    int sum2 = num2;

    int n1, n2;       //记录各加了几次
    n1 = n2 = 0;
    if(flag == 1)  //两数互质
    {
        while(1)
        {
            if(sum1 - sum2 == 1 || sum2 - sum1 == 1)
            {
                break;
            }
            else
            {
                if(sum1 < sum2)
                {
                    sum1 += num1;
                    n1++;

                }
                else
                {
                    sum2 += num2;
                    n2++;
                }
            }
        }
    }
    printf("num1 = %d 加了%d次为: %d\n", num1, n1, sum1);
    printf("num2 = %d 加了%d次为: %d", num2, n2, sum2);

    return 0;
}
