/*************************************************************************
	> File Name: 065排序二位数组.c
	> Author: 
	> Mail: 
	> Created Time: 2017年09月26日 星期二 15时20分57秒
 ************************************************************************/
/*
* 二维数组排序。设有 4×5 的数组 M通过排序使 M[1][1]≤M[1][2]≤...≤M[1][5]≤
* M[2][1]≤M[2][2]≤...≤M[2][5]≤...≤M[4][1]≤M[4][2]≤...≤M[4][5]。排序时不允许引入其它数组
* */
#include<stdio.h>

//插入排序

void insertsort(int a[], int n)
{
    for(int i = 1; i < n; i++)
    {
        int j = i-1;
        int temp = a[i];
        while(j >= 0 && a[j] > temp)
        {
            a[j+1] = a[j];
            j--;
        }
        a[j+1] = temp; 
    }

}

int main()
{
    //本质是连续的一维数组
    int a[4][5] = {
        {5,4,23,21,0},
        {1,56,17,9,32},
        {21,5,3,8,19},
        {15,4,21,16,3}
    };


    int s[4] = {4,1,3,2};
    insertsort((int *)a, 4*5);
    for(int i = 0; i < 4; i++)
    {
        for(int j = 0; j < 5; j++)
        {
            printf("%2d ", a[i][j]);
        }
        printf("\n");
    }
}
