/*************************************************************************
	> File Name: 077大数相加.c
	> Author: 
	> Mail: 
	> Created Time: 2017年10月01日 星期日 19时58分21秒
 ************************************************************************/
/*
*大数相加。 
写一个程序实现对任意长的两个大整数例如 100 位进行相加.
每个数可用以下形式存放例如整数179534679198可放于数组N中其中  
N[1]=198, N[2]=679, N[3]=534, N[4]=179 
把两个数组中的元素一一相加并根据需要进行进位。 
要求 :
    1) 输出一个大数时中间不允许有空格 如上述N数组输出时不允许输出 
    179 534 679 198 而应输出  179534679198

    2) 输出的数据中间的零不能用空格代替。 
    假设N[1]=23, N[2]=5, N[3]=534, N[4]=179时应输出 
    179534005023 而不应输出 
    179534  5 23 
    思考: 一个数组元素存放一位数时应如何修改程序?

    //进位不在是进1  而是进a[i]/10  自己存的位不是减1000而是a[i]%10
*/
#include<stdio.h>
#define SIZE 100

void print(int a[])
{
    int i = 0;
    for(i = SIZE-1; i > 0; i--)
    {
        if(a[i] != 0)
        {
            break;
        }
    }
    for(; i > 0; i--)
    {
        if(a[i] < 100)
        {
            printf("0");
        }
        printf("%d",a[i]);
    }
    printf("\n");
}

void Sum(int a[], int b[], int sum[])
{
    int i = 0;
    for(i = SIZE-1; i > 0; i--)
    {
        if(a[i] != 0)
        {
            break;
        }
    }
    int j = 0;
    for(j = SIZE-1; j > 0; j--)
    {
        if(a[j] != 0)
        {
            break;
        }
    }

    int min = (i>j ? i:j);

    while(i > 0 && j > 0)
    {
        if(i > j)
        {
            sum[i] = a[i];
            i--;
        }
        else if(j > i)
        {
            sum[j] = b[j];
            j--;
        }
        else
        {
            sum[i] = a[i] + b[j];
            for(int k = i; k < min; k++)
            {
                if(sum[i] > 999)
                {
                    sum[i+1] += 1;
                    sum[i] = sum[i] - 1000;
                }
            }
            i--,j--;
        }
    }
}

int main()
{
    int N[SIZE] = {0};
    int M[SIZE] = {0};
    int SUM[SIZE] = {0};
    
    //N是111179534679198
    N[1] = 198;
    N[2] = 679;
    N[3] = 534;
    N[4] = 179;
    N[5] = 111;
    print(N);

    //M是111170534609098
    M[1] = 98;
    M[2] = 609;
    M[3] = 534;
    M[4] = 170;
    M[5] = 111;
    print(M);

    Sum(N, M, SUM); 
    print(SUM);

    return 0;
}

